Revit 2027 API
Speckle Class
 A static class that provides access to the property names that appear in the Speckle visual asset schema.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Speckle
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class Speckle
Public NotInheritable Class Speckle
public ref class Speckle abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type Speckle = class end
The Speckle type exposes the following members.
Properties
Name | Description
SpeckleColor1 |  The property labeled "Color 1" from the "Speckle" schema.
SpeckleColor2 |  The property labeled "Color 2" from the "Speckle" schema.
SpeckleSize |  The property labeled "Size" from the "Speckle" schema.
TextureAngle |  The property labeled "Angle" from the "Speckle" schema.
TextureLinkTextureTransforms |  The property labeled "Link Transforms" from the "Speckle" schema.
TextureRealWorldOffsetX |  The property labeled "Offset X" from the "Speckle" schema.
TextureRealWorldOffsetY |  The property labeled "Offset Y" from the "Speckle" schema.
TextureRealWorldOffsetZ |  The property labeled "Offset Z" from the "Speckle" schema.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace